app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    #@movies = Movie.all
    @hilite = Hash.new { |hash, key| hash[key] = '' }
    @all_ratings = Movie.rating()

    sort = params[:sort]
    if sort == 'title'
    	@movies = Movie.find(:all, :order => 'title')
    elsif sort == 'release_date'
    	@movies = Movie.find(:all, :order => 'release_date')
    else
    	@movies = Movie.all